# ModelCurveNode Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveNode Class
Members See Also
---
A base class of output nodes that represent various model curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class ModelCurveNode : RenderNode
```

Visual Basic
---
```text
Public Class ModelCurveNode _
	Inherits RenderNode
```

Visual C++
---
```text
public ref class ModelCurveNode : public RenderNode
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..ModelCurveNode Autodesk.Revit.DB..::..CurveNode Autodesk.Revit.DB..::..PointNode Autodesk.Revit.DB..::..PolylineNode
# See Also
ModelCurveNode Members
Autodesk.Revit.DB Namespace